package Homeworks.HW_Lesson1;

/*Використовуючи IntelliJ IDEA, створіть проект із класом main.
Створіть дві цілі перемінні і виведіть на екран результати всіх арифметичних операцій над цими двома змінними.*/

public class HW0 {
    public static void main(String[] args) {
        int x = 10;
        int y = 2;

        System.out.println("/ => " + (x / y) + "\n* => " + (x * y) + "\n+ => " + (x + y) + "\n- => " + (x - y));
    }
}

/* P.S. Оскільки я створив package і розбиваю всі завдання для себе зручно по частинам. Саме клас main створювати не дуже зручно,
але сподіваюсь, це не критично.*/

