package Homeworks.HW_Lesson1;

/*Використовуючи IntelliJ IDEA, створіть клас Arithmetic Average. Обчисліть середнє арифметичне трьох цілих значень і виведіть його на екран.
З якою проблемою ви зіткнулися? Який тип змінних краще використовуватиме коректне відображення результату?*/

public class HW5_Arithmetic_Average {
    public static void main(String[] args) {
        int x = 4;
        int y = 10;
        int z = 20;
        System.out.println("Arithmetic Average: " + ((x + y + z) / 2));
    }

    /*З проблемами зі знаходження сер.ариф трьох цілих чисел я не зіткнувся. Проте, якщо ввести числа з комою, середнє
    арифметичне буде знайдено некоректно (буде виведена лише ціла частина результуючого ззначення, тому потрібно використовувати
    тип float / double (і саме їх краще використовувати для коректного відображення результату).*/
}